samples/retrieve_send_email_mo_key_definition.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Header>
  <wsse:Security
   xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
     xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
   <wsu:Timestamp>
    <wsu:Created>2011-02-09T18:43:50Z</wsu:Created>
    <wsu:Expires>2011-02-09T18:48:50Z</wsu:Expires>
   </wsu:Timestamp>
   <wsse:UsernameToken>
    <wsse:Username>*******</wsse:Username>
    <wsse:Password
   Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">********</wsse:Password>
    <wsse:Nonce>j41KU2X3qEdcijEhlfJ5M+1dyD0=</wsse:Nonce>
    <wsu:Created>2011-02-09T18:43:50Z</wsu:Created>
   </wsse:UsernameToken>
  </wsse:Security>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
  <RetrieveRequestMsg xmlns="http://exacttarget.com/wsdl/partnerAPI">
   <RetrieveRequest>
    <ObjectType>SendEmailMOKeyword</ObjectType>
    <Properties>RowID</Properties>
    <Properties>Client.ID</Properties>
    <Properties>CreatedDate</Properties>
    <Properties>ModifiedDate</Properties>
    <Properties>CustomerKey</Properties>
    <Properties>IsDefaultKeyword</Properties>
    <Properties>SuccessMessage</Properties>
    <Properties>MissingEmailMessage</Properties>
    <Properties>FailureMessage</Properties>
    <Properties>TriggeredSend.CustomerKey</Properties>
   </RetrieveRequest>
  </RetrieveRequestMsg>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
